<?php

namespace Database\Factories;

use App\Models\Categories;
use App\Models\Favorite;
use App\Models\Photos;
use App\Models\Report;
use App\Models\ServicePost;
use App\Models\Sub_categories;
use App\Models\User;
use Illuminate\Database\Eloquent\Factories\Factory;


/**
 * @extends Factory<ServicePost>
 */
class ServicePostFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */


    public function definition(): array
    {
        static $PostIndex = 0;
        $Posts = array(
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "تقني", "sub_categories_id" => "108", "title" => "مبرمج PHP", "description" => "نحن نبحث عن مبرمج PHP محترف للانضمام إلى فريقنا. يجب أن يكون المرشح ذو خبرة جيدة في PHP وقواعد البيانات وتطوير واجهات المستخدم."],
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "تقني", "sub_categories_id" => "108", "title" => "مطور تطبيقات الجوال", "description" => "نحن نبحث عن مطور تطبيقات الجوال للانضمام إلى فريقنا. يجب أن يكون المرشح ذو خبرة جيدة في تطوير تطبيقات الجوال لنظامي IOS و Android."],
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "تقني", "sub_categories_id" => "108", "title" => "مهندس شبكات", "description" => "نحن نبحث عن مهندس شبكات للانضمام إلى فريق الدعم الفني لدينا. يجب أن يكون المرشح ذو خبرة في إدارة شبكات الكمبيوتر والتعامل مع مشاكل الشبكات."],
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "تقني", "sub_categories_id" => "108", "title" => "مهندس برمجيات", "description" => "نحن نبحث عن مهندس برمجيات للانضمام إلى فريق البرمجة لدينا. يجب أن يكون المرشح ذو خبرة جيدة في تطوير البرمجيات باستخدام لغات البرمجة المختلفة."],
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "حدائق ومناظر", "sub_categories_id" => "109", "title" => "مصمم حدائق", "description" => "نحن نبحث عن مصمم حدائق لتصميم وتنفيذ مخططات الحدائق والمناظر الطبيعية. يجب أن يكون المرشح ذو خبرة في استخدام النباتات والزهور والأشجار لتزيين المساحات الخضراء.",],
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "حدائق ومناظر", "sub_categories_id" => "109", "title" => "فني صيانة حدائق", "description" => "نحن نبحث عن فني صيانة حدائق للعمل على صيانة المساحات الخضراء وتنظيفها وترتيبها. يجب أن يكون المرشح ذو خبرة في استخدام الأدوات اللازمة للصيانة مثل المحراث والقصاصات.",],
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "حراسة وامن", "sub_categories_id" => "110", "title" => "حارس أمن", "description" => "نحن نبحث عن حارس أمن لحماية الممتلكات والأفراد. يجب أن يكون المرشح ذو خبرة في التعامل مع حالات الطوارئ واستخدام الأسلحة النارية والحماية من الحرائق.",],
            ["category" => "وظائف", "categories_id" => "1", "sub_category" => "حرفيين", "sub_categories_id" => "111", "title" => "نجار", "description" => "نحن نبحث عن نجار محترف للعمل في تصميم وتنفيذ الأثاث والأعمال الخشبية. يجب أن يكون المرشح ذو خبرة في استخدام الأدوات اليدوية والآلية وتصميم القطع الخشبية.",],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'سياحة ومطاعم', 'sub_categories_id' => '119', 'title' => 'وظائف سياحة ومطاعم', 'description' => 'ابحث عن فرص عمل في مجال السياحة والمطاعم، وتصفح الوظائف المتاحة في هذا القطاع النشط والمزدهر. استكشف وظائف الطبخ والخدمة والإدارة، وابحث عن فرص للترقية والتطوير المهني.'],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'شراكة', 'sub_categories_id' => '120', 'title' => 'وظائف شراكة', 'description' => 'ابحث عن فرص شراكة في مختلف المجالات، وتعاون مع شركاء ذوي خبرة وكفاءة عالية. اطلع على فرص الشراكة في المشاريع التجارية والإبداعية، وتواصل مع الشركاء المحتملين لتحقيق النجاح المشترك.'],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'طب وتمريض', 'sub_categories_id' => '121', 'title' => 'وظائف طب وتمريض', 'description' => 'ابحث عن فرص عمل في مجال الطب والتمريض، وتصفح الوظائف المتاحة في المستشفيات والمراكز الصحية. استكشف فرص العمل في مجالات مثل الجراحة والأشعة والتمريض العام والعلاج الطبيعي، وابحث عن فرص للتدريب والتطوير المهني.'],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'علاقات عامة', 'sub_categories_id' => '122', 'title' => 'وظائف علاقات عامة', 'description' => 'ابحث عن فرص عمل في مجال العلاقات العامة، وتصفح الوظائف المتاحة في هذا المجال الحيوي والمثير للإعجاب. استكشف فرص العمل في مجالات مثل الإعلام والتسويق والاتصالات، '],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'مبيعات وتسويق', 'sub_categories_id' => '130', 'title' => 'وظائف مبيعات وتسويق', 'description' => 'ابحث عن فرص عمل في مجال المبيعات والتسويق، وتصفح الوظائف المتاحة في هذا المجال الحيوي والمثير للإعجاب. استكشف فرص العمل في مجالات مثل التسويق الرقمي والإعلان والعلاقات العامة،'],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'مترجمين', 'sub_categories_id' => '131', 'title' => 'وظائف مترجمين', 'description' => 'ابحث عن فرص عمل في مجال الترجمة، وتصفح الوظائف المتاحة في هذا المجال الحيوي والمثير للإعجاب. استكشف فرص العمل في مجالات مثل الترجمة الفورية والتحرير والنشر،'],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'محاماه وقانون', 'sub_categories_id' => '132', 'title' => 'وظائف محاماه وقانون', 'description' => 'ابحث عن فرص عمل في مجال القانون والمحاماة، وتصفح الوظائف المتاحة في هذا المجال الحيوي والمثير للإعجاب. استكشف فرص العمل في مجالات مثل القانون الجنائي والتجاري والعمل،'],
            ['category' => 'وظائف', 'categories_id' => '1', 'sub_category' => 'محررين', 'sub_categories_id' => '133', 'title' => 'وظائف محررين', 'description' => 'ابحث عن فرص عمل في مجال التحرير والكتابة، وتصفح الوظائف المتاحة في هذا المجال الحيوي والمثير للإعجاب. استكشف فرص العمل في مجالات مثل الصحافة والإعلام والنشر،'],
            ['sub_categories_id' => '102', 'categories_id' => '1', 'sub_category' => 'إدارة', 'category' => 'وظائف', "title" => "وظائف إدارية", "description" => "تتضمن الوظائف التي تتطلب مهارات إدارية وقيادية مثل الإدارة العامة، الإدارة المالية، إدارة الموارد البشرية وغيرها."],
            ['sub_categories_id' => '104', 'categories_id' => '1', 'sub_category' => 'برمجة', 'category' => 'وظائف', "title" => "وظائف البرمجة", "description" => "تشمل الوظائف التي تتطلب مهارات في البرمجة وتطوير البرمجيات، مثل مطوري الويب ومطوري التطبيقات ومهندسي البرمجيات وغيرهم."],
            ['sub_categories_id' => '105', 'categories_id' => '1', 'sub_category' => 'تزيين وتجميل', 'category' => 'وظائف', "title" => "وظائف التجميل", "description" => "تشمل الوظائف التي تتطلب مهارات في مجال التجميل والتزيين، مثل مصففي الشعر، وخبراء التجميل ومصممي الأظافر وغيرهم."],
            ['sub_categories_id' => '106', 'categories_id' => '1', 'sub_category' => 'تصميم', 'category' => 'وظائف', "title" => "وظائف التصميم", "description" => "تشمل الوظائف التي تتطلب مهارات في مجال التصميم الجرافيكي والتصميم الصناعي والتصميم الداخلي وغيرهم."],
            ['sub_categories_id' => '112', 'categories_id' => '1', 'sub_category' => 'محاسبة', 'category' => 'وظائف', "title" => "وظائف محاسبة", "description" => "ابحث عن وظائف في مجال المحاسبة في الشركات المختلفة."],
            ['sub_categories_id' => '113', 'categories_id' => '1', 'sub_category' => 'حضانة أطفال', 'category' => 'وظائف', "title" => "وظائف حضانة الأطفال", "description" => "ابحث عن فرص عمل في رياض الأطفال وحضانات الأطفال المختلفة."],
            ['sub_categories_id' => '115', 'categories_id' => '1', 'sub_category' => 'خياطين', 'category' => 'وظائف', "title" => "وظائف الخياطين", "description" => "ابحث عن فرص عمل للخياطين في الشركات والمحال المختلفة."],
            ['sub_categories_id' => '116', 'categories_id' => '1', 'sub_category' => 'سائق', 'category' => 'وظائف', "title" => "وظائف السائقين", "description" => "ابحث عن فرص عمل للسائقين في الشركات والمؤسسات المختلفة."],
            ['sub_categories_id' => '117', 'categories_id' => '1', 'sub_category' => 'سكرتارية', 'category' => 'وظائف', "title" => "وظائف السكرتارية", "description" => "ابحث عن فرص عمل للمساعدين الإداريين والسكرتاريا في مختلف المجالات."],
            ['sub_categories_id' => '119', 'categories_id' => '1', 'sub_category' => 'سياحة ومطاعم', 'category' => 'وظائف', "title" => "وظائف السياحة والمطاعم", "description" => "ابحث عن فرص عمل في مجال السياحة والضيافة، والمطاعم والفنادق المختلفة."],
            ['sub_categories_id' => '108', 'categories_id' => '1', 'sub_category' => 'تقني', 'category' => 'وظائف', "title" => "وظائف التقنية", "description" => "تشمل الوظائف التي تتطلب مهارات تقنية في مجالات مثل تطوير البرمجيات، والشبكات، والتحليل البياني وغيرها."],
            ['sub_categories_id' => '121', 'categories_id' => '1', 'sub_category' => 'طب وتمريض', 'category' => 'وظائف', "title" => "وظائف الطب والتمريض", "description" => "ابحث عن فرص عمل في مجال الطب والتمريض في المستشفيات والمراكز الطبية المختلفة."],
            ['sub_categories_id' => '121', 'categories_id' => '1', 'sub_category' => 'طب وتمريض', 'category' => 'وظائف', "title" => "ممرضة", "description" => "مطلوب ممرضة للعمل في مستشفى في فلسطين."],
            ['sub_categories_id' => '122', 'categories_id' => '1', 'sub_category' => 'علاقات عامة', 'category' => 'وظائف', "title" => "مسؤولة علاقات عامة", "description" => "شركة في فلسطين تبحث عن مسؤولة علاقات عامة ذو خبرة في المجال."],
            ['sub_categories_id' => '128', 'categories_id' => '1', 'sub_category' => 'كمبيوتر وشبكات', 'category' => 'وظائف', "title" => "مبرمجة", "description" => "شركة تقنية تبحث عن مبرمجة للعمل في فلسطين."],
            ['sub_categories_id' => '130', 'categories_id' => '1', 'sub_category' => 'مبيعات وتسويق', 'category' => 'وظائف', "title" => "مديرة مبيعات", "description" => "شركة تبحث عن مديرة مبيعات ذو خبرة للعمل في فلسطين."],
            ['sub_categories_id' => '123', 'categories_id' => '1', 'sub_category' => 'عمال', 'category' => 'وظائف', "title" => "عاملة بناء", "description" => "مطلوب عاملة بناء للعمل في موقع بناء في فلسطين."],
            ['sub_categories_id' => '124', 'categories_id' => '1', 'sub_category' => 'عمال تنظيف', 'category' => 'وظائف', "title" => "عاملة تنظيف", "description" => "شركة تنظيف تبحث عن عاملة تنظيف للعمل في فلسطين."],
            ['sub_categories_id' => '125', 'categories_id' => '1', 'sub_category' => 'عمال ديلفري', 'category' => 'وظائف', "title" => "سائقة توصيل", "description" => "شركة توصيل تبحث عن سائقة توصيل ذو خبرة للعمل في فلسطين."],
            ['sub_categories_id' => '1', 'categories_id' => '3', 'sub_category' => 'أراضي', 'category' => 'عقارات', "title" => "قطعة أرض للبيع", "description" => "قطعة أرض مميزة للبيع بموقع متميز في المدينة، تصلح لبناء فلل أو مشاريع عقارية."],
            ['sub_categories_id' => '2', 'categories_id' => '3', 'sub_category' => 'استديو', 'category' => 'عقارات', "title" => "استديو مفروش للإيجار", "description" => "استديو مفروش بالكامل للإيجار في موقع هادئ ومريح، يحتوي على كل الأثاث والأجهزة الضرورية للإقامة المريحة."],
            ['sub_categories_id' => '3', 'categories_id' => '3', 'sub_category' => 'بيت شعبي', 'category' => 'عقارات', "title" => "بيت شعبي تراثي للبيع", "description" => "بيت شعبي تراثي فريد من نوعه للبيع، يحتوي على العديد من التفاصيل الجميلة والأصالة التي تجعله قطعة فنية."],
            ['sub_categories_id' => '4', 'categories_id' => '3', 'sub_category' => 'سكن عمال', 'category' => 'عقارات', "title" => "سكن عمال بموقع مريح", "description" => "سكن عمال بموقع مريح ومتميز يحتوي على جميع المرافق الضرورية والخدمات التي يحتاجها العمال."],
            ['sub_categories_id' => '5', 'categories_id' => '3', 'sub_category' => 'شاليهات', 'category' => 'عقارات', "title" => "شاليه فاخر للبيع", "description" => "شاليه فاخر بتصميم عصري وجميل للبيع، يقع في منتجع سياحي متميز بجميع الخدمات السياحية المميزة."],
            ['sub_categories_id' => '6', 'categories_id' => '3', 'sub_category' => 'شقق', 'category' => 'عقارات', "title" => "شقق للبيع والإيجار", "description" => "احصل على شقتك المفضلة للبيع أو الإيجار في منطقتك المفضلة بأسعار معقولة ومناسبة لميزانيتك."],
            ['sub_categories_id' => '7', 'categories_id' => '3', 'sub_category' => 'شقق مفروشة', 'category' => 'عقارات', "title" => "شقق مفروشة للإيجار", "description" => "تصفح العديد من الشقق المفروشة المتاحة للإيجار في مناطق مختلفة، واختر ما يناسب ذوقك وميزانيتك."],
            ['sub_categories_id' => '8', 'categories_id' => '3', 'sub_category' => 'دولية', 'category' => 'عقارات', "title" => "عقارات دولية للبيع والإيجار", "description" => "تصفح العقارات المتاحة للبيع والإيجار في دول مختلفة، واستثمر في عقارات دولية تتمتع بإطلالات خلابة ومواصفات عالية الجودة."],
            ['sub_categories_id' => '9', 'categories_id' => '3', 'sub_category' => 'عمارات ومباني', 'category' => 'عقارات', "title" => "عمارات ومباني للبيع والإيجار", "description" => "تصفح العديد من العمارات والمباني المتاحة للبيع والإيجار في مناطق مختلفة، واختر ما يناسب احتياجاتك وميزانيتك."],
            ['sub_categories_id' => '10', 'categories_id' => '3', 'sub_category' => 'فلل ومنازل', 'category' => 'عقارات', "title" => "فلل ومنازل للبيع والإيجار", "description" => "استكشف العديد من الفلل والمنازل المتاحة للبيع والإيجار في مناطق مختلفة، واختر ما يناسب ذوقك ومتطلباتك."],
            ['sub_categories_id' => '11', 'categories_id' => '3', 'sub_category' => 'فنادق ومنتجعات', 'category' => 'عقارات', "title" => "استمتع بالراحة والترفيه", "description" => "احجز إقامتك في فنادقنا ومنتجعاتنا الفخمة واستمتع بالراحة والترفيه في جو من الفخامة والرفاهية."],
            ['sub_categories_id' => '12', 'categories_id' => '3', 'sub_category' => 'قاعات', 'category' => 'عقارات', "title" => "احتفل بأفضل الأوقات", "description" => "استأجر قاعتك الخاصة لتحتفل بأفضل الأوقات في حفل زفاف، مناسبة تخرج، حفلة عيد ميلاد، أو أي مناسبة تحتاجها."],
            ['sub_categories_id' => '13', 'categories_id' => '3', 'sub_category' => 'قيد الانشاء', 'category' => 'عقارات', "title" => "العقارات الجديدة قيد الإنشاء", "description" => "تعرف على العقارات الجديدة التي تم تطويرها وهي قيد الإنشاء، واحجز وحدتك المناسبة لك قبل الانتهاء من البناء."],
            ['sub_categories_id' => '14', 'categories_id' => '3', 'sub_category' => 'مجمعات تجارية', 'category' => 'عقارات', "title" => "استثمر في مجمعات تجارية", "description" => "استثمر في مجمعات تجارية تضم متاجر متنوعة ومطاعم ومنشآت أخرى، واستمتع بأرباح جيدة من عائدات الإيجارات."],
            ['sub_categories_id' => '15', 'categories_id' => '3', 'sub_category' => 'محلات', 'category' => 'عقارات', "title" => "تأجير محلات تجارية", "description" => "تأجير محلات تجارية في أفضل المواقع التجارية وبأسعار تنافسية، وتحقيق أرباح جيدة من الإيجارات."],
            ['sub_categories_id' => '16', 'categories_id' => '3', 'sub_category' => 'مزارع', 'category' => 'عقارات', "title" => "مزرعة للبيع", "description" => "تعتبر المزارع خيارًا جيدًا للراغبين في الاستثمار في العقارات، فهي توفر فرصة للحصول على دخل من خلال زراعة المحاصيل أو تربية الحيوانات، ويمكن بيعها بأسعار مرتفعة عند الاستثمار في المزارع المثمرة."],
            ['sub_categories_id' => '17', 'categories_id' => '3', 'sub_category' => 'مستودعات', 'category' => 'عقارات', "title" => "مستودع للإيجار", "description" => "تعد المستودعات خيارًا رائجًا للأفراد والشركات الذين يحتاجون إلى مساحة تخزين إضافية لسلعهم ومنتجاتهم. يمكن استخدام المستودعات للتخزين المؤقت أو الدائم للسلع بمختلف الأحجام والأشكال."],
            ['sub_categories_id' => '18', 'categories_id' => '3', 'sub_category' => 'مشاركة سكن', 'category' => 'عقارات', "title" => "مشاركة سكن", "description" => "تُعتبر مشاركة السكن خيارًا اقتصاديًا للأفراد الذين يرغبون في توفير تكاليف الإيجار، حيث يتم مشاركة الإيجار وتكاليف المنزل مع شخص آخر أو أكثر، وبالتالي تقليل النفقات. وتوفر هذه الخيارات العديد من المزايا الاجتماعية أيضًا."],
            ['sub_categories_id' => '19', 'categories_id' => '3', 'sub_category' => 'مصانع', 'category' => 'عقارات', "title" => "مصنع للإيجار", "description" => "تعد المصانع من أهم العقارات التجارية، حيث تستخدم لإنتاج المنتجات وتخزينها وتوزيعها، ويمكن استئجارها للأفراد أو الشركات التي تحتاج إلى مساحة إنتاج إضافية  "],
            ['sub_categories_id' => '20', 'categories_id' => '3', 'sub_category' => 'مطاعم ومقاهي', 'category' => 'عقارات', "title" => "مطاعم ومقاهي للايجار", "description" => "تصفح أفضل عروض الإيجار للمطاعم والمقاهي في المنطقة التي تبحث عنها واختر المكان المثالي لتأسيس عملك التجاري."],
            ['sub_categories_id' => '21', 'categories_id' => '3', 'sub_category' => 'مكاتب', 'category' => 'عقارات', "title" => "مكاتب للايجار", "description" => "تصفح أفضل عروض الإيجار للمكاتب في المنطقة التي تبحث عنها واختر المكان المناسب لنشاطك التجاري."],
            ['sub_categories_id' => '22', 'categories_id' => '3', 'sub_category' => 'متفرقات', 'category' => 'عقارات', "title" => "عقارات متنوعة للبيع والإيجار", "description" => "تصفح أحدث العروض للعقارات المتنوعة للبيع والإيجار، من شقق وفلل ومخازن ومكاتب ومحلات تجارية، واختر ما يناسبك في المنطقة التي ترغب فيها."],
            ['sub_categories_id' => '23', 'categories_id' => '4', 'sub_category' => 'استيراد سيارات', 'category' => 'سيارات', "title" => "خدمات الاستيراد", "description" => "تقدم شركتنا خدمات الاستيراد الكاملة للسيارات من جميع الدول حول العالم، بدءًا من البحث عن السيارة المناسبة لاحتياجات العميل وحتى توصيلها إلى باب منزله."],
            ['sub_categories_id' => '24', 'categories_id' => '4', 'sub_category' => 'قطاع غيار', 'category' => 'سيارات', "title" => "قطع غيار عالية الجودة", "description" => "نقدم قطع غيار عالية الجودة لجميع أنواع السيارات بأسعار تنافسية. تتضمن خدماتنا توصيل القطع المطلوبة إلى عنوان العميل وتركيبها بأيدي فنيين ذوي خبرة."],
            ['sub_categories_id' => '25', 'categories_id' => '4', 'sub_category' => 'خدمات السيارات', 'category' => 'سيارات', "title" => "خدمات السيارات الشاملة", "description" => "تشمل خدماتنا الشاملة للسيارات الصيانة الدورية والإصلاحات والتشخيص وتركيب القطع الغيار والخدمات الإضافية مثل تلميع السيارة وتغيير الزيوت وتغيير الإطارات."],
            ['sub_categories_id' => '26', 'categories_id' => '4', 'sub_category' => 'اكسسورات', 'category' => 'سيارات', "title" => "اكسسوارات أنيقة وعصرية", "description" => "تقدم شركتنا مجموعة واسعة من الاكسسوارات العصرية والأنيقة للسيارات، بما في ذلك أغطية المقاعد وأغطية السيارة والحوامل والملصقات والمزيد، كلها بأسعار معقولة."],
            ['sub_categories_id' => '27', 'categories_id' => '4', 'sub_category' => 'تاجير', 'category' => 'سيارات', "title" => "تأجير سيارات", "description" => "نقدم خدمات تأجير السيارات لجميع الفئات بأسعار تنافسية وخدمة عملاء متميزة."],
            ['sub_categories_id' => '28', 'categories_id' => '4', 'sub_category' => 'ارقام', 'category' => 'سيارات', "title" => "أرقام سيارات", "description" => "تصفح أحدث الأرقام المميزة للسيارات واختر الرقم الذي يناسب ذوقك."],
            ['sub_categories_id' => '29', 'categories_id' => '4', 'sub_category' => 'استون مارتن', 'category' => 'سيارات', "title" => "أستون مارتن", "description" => "تعرّف على أحدث سيارات أستون مارتن بتصاميمها الفريدة والفاخرة والمواصفات الفنية المتطورة."],
            ['sub_categories_id' => '30', 'categories_id' => '4', 'sub_category' => 'اسيا', 'category' => 'سيارات', "title" => "اسيا", "description" => "تصفح أحدث السيارات من شركة اسيا وتعرف على المواصفات والأسعار وتقييمات المستخدمين."],
            ['sub_categories_id' => '31', 'categories_id' => '4', 'sub_category' => 'الفا روميو', 'category' => 'سيارات', "title" => "الفا روميو", "description" => "تعرف على أحدث سيارات الفا روميو بتصاميمها الرياضية والجذابة والمواصفات الفنية المتطورة."],
            ['sub_categories_id' => '32', 'categories_id' => '4', 'sub_category' => 'ام جي', 'category' => 'سيارات', "title" => "ام جي", "description" => "تصفح أحدث السيارات من شركة أم جي وتعرف على المواصفات والأسعار وتقييمات المستخدمين."],
            ['sub_categories_id' => '33', 'categories_id' => '4', 'sub_category' => 'انفينيتي', 'category' => 'سيارات', "title" => "إنفينيتي الفاخرة", "description" => "تصفح أحدث طرازات سيارات إنفينيتي الفاخرة مع تقنيات عالية المستوى وأداء فائق."],
            ['sub_categories_id' => '34', 'categories_id' => '4', 'sub_category' => 'اوبل', 'category' => 'سيارات', "title" => "اوبل المتميزة", "description" => "تصفح أحدث طرازات سيارات اوبل المتميزة مع تقنيات عالية المستوى وأداء فائق."],
            ['sub_categories_id' => '35', 'categories_id' => '4', 'sub_category' => 'اودي', 'category' => 'سيارات', "title" => "اودي الألمانية", "description" => "تصفح أحدث طرازات سيارات اودي الألمانية المصنوعة بجودة عالية وتقنيات متطورة."],
            ['sub_categories_id' => '44', 'categories_id' => '4', 'sub_category' => 'بويك', 'category' => 'سيارات', "title" => "بويك الرائدة", "description" => "تصفح أحدث طرازات سيارات بويك الرائدة بتصميمات جذابة وتقنيات عالية المستوى."],
            ['sub_categories_id' => '45', 'categories_id' => '4', 'sub_category' => 'بي ام دبليو', 'category' => 'سيارات', "title" => "بي ام دبليو الرياضية", "description" => "تصفح أحدث طرازات سيارات بي ام دبليو الرياضية بتقنيات عالية المستوى وأداء فائق."],
            ['sub_categories_id' => '46', 'categories_id' => '4', 'sub_category' => 'بيجو', 'category' => 'سيارات', "title" => "بيجو الأنيقة", "description" => "تصفح أحدث طرازات سيارات بيجو الأنيقة بتصميمات عصرية وتقنيات متطورة."],
            ['sub_categories_id' => '48', 'categories_id' => '4', 'sub_category' => 'تويوتا', 'category' => 'سيارات', "title" => "سيارات تويوتا المستعملة", "description" => "ابحث عن سيارات تويوتا المستعملة للبيع في منطقتك."],
            ['sub_categories_id' => '52', 'categories_id' => '4', 'sub_category' => 'جيب', 'category' => 'سيارات', "title" => "سيارات جيب المستعملة", "description" => "تصفح الإعلانات المبوبة للعثور على سيارات جيب المستعملة للبيع."],
            ['sub_categories_id' => '61', 'categories_id' => '4', 'sub_category' => 'رينو', 'category' => 'سيارات', "title" => "سيارات رينو المستعملة", "description" => "تصفح الإعلانات المبوبة للعثور على سيارات رينو المستعملة للبيع."],
            ['sub_categories_id' => '66', 'categories_id' => '4', 'sub_category' => 'سكودا', 'category' => 'سيارات', "title" => "سيارات سكودا المستعملة", "description" => "تصفح الإعلانات المبوبة للعثور على سيارات سكودا المستعملة للبيع."],
            ['sub_categories_id' => '67', 'categories_id' => '4', 'sub_category' => 'سمارت', 'category' => 'سيارات', "title" => "سيارات سمارت المستعملة", "description" => "تصفح الإعلانات المبوبة للعثور على سيارات سمارت المستعملة للبيع."],
            ['sub_categories_id' => '68', 'categories_id' => '4', 'sub_category' => 'سوبارو', 'category' => 'سيارات', "title" => "سيارات سوبارو المستعملة", "description" => "تصفح الإعلانات المبوبة للعثور على سيارات سوبارو المستعملة للبيع."],
            ['sub_categories_id' => '69', 'categories_id' => '4', 'sub_category' => 'سوزوكي', 'category' => 'سيارات', "title" => "سيارات سوزوكي المستعملة", "description" => "ابحث عن سيارات سوزوكي المستعملة للبيع في منطقتك."],
            ['sub_categories_id' => '70', 'categories_id' => '4', 'sub_category' => 'سيات', 'category' => 'سيارات', "title" => "سيارات سيات", "description" => "استكشف أحدث سيارات سيات وتعرف على مواصفاتها وأسعارها واحجز سيارتك الجديدة الآن."],
            ['sub_categories_id' => '75', 'categories_id' => '4', 'sub_category' => 'فورد', 'category' => 'سيارات', "title" => "سيارات فورد", "description" => "استمتع بقيادة أحدث سيارات فورد وتعرف على مواصفاتها وأسعارها واحجز سيارتك الجديدة الآن."],
            ['sub_categories_id' => '76', 'categories_id' => '4', 'sub_category' => 'فولفو', 'category' => 'سيارات', "title" => "سيارات فولفو", "description" => "تعرف على أحدث سيارات فولفو واستمتع بتجربة القيادة الفريدة والأنيقة مع مواصفاتها وأسعارها واحجز سيارتك الجديدة الآن."],
            ['sub_categories_id' => '77', 'categories_id' => '4', 'sub_category' => 'فولكس واجن', 'category' => 'سيارات', "title" => "سيارات فولكس واجن", "description" => "تعرف على أحدث سيارات فولكس واجن وتمتع بالتصميم الأنيق والأداء العالي واحجز سيارتك الجديدة الآن."],
            ['sub_categories_id' => '78', 'categories_id' => '4', 'sub_category' => 'فيات', 'category' => 'سيارات', "title" => "سيارات فيات", "description" => "تعرف على أحدث سيارات فيات واستمتع بأدائها العالي وتصميمها الرائع واحجز سيارتك الجديدة الآن."],
            ['sub_categories_id' => '82', 'categories_id' => '4', 'sub_category' => 'كيا', 'category' => 'سيارات', "title" => "سيارات كيا", "description" => "تعرف على أحدث سيارات كيا واستمتع بمواصفاتها العالية وتصميمها المميز واحجز سيارتك الجديدة الآن."],
            ['sub_categories_id' => '87', 'categories_id' => '4', 'sub_category' => 'لكزس', 'category' => 'سيارات', "title" => "سيارات لكزس الفاخرة", "description" => "تتضمن هذه الفئة أحدث سيارات لكزس الفاخرة، والتي تجمع بين الأداء العالي والراحة والتكنولوجيا المتقدمة."],
            ['sub_categories_id' => '88', 'categories_id' => '4', 'sub_category' => 'لينكولن', 'category' => 'سيارات', "title" => "سيارات لينكولن الفاخرة", "description" => "تشمل هذه الفئة أحدث سيارات لينكولن الفاخرة، التي تتميز بالأناقة الرفيعة والراحة الفائقة والتكنولوجيا المتطورة."],
            ['sub_categories_id' => '89', 'categories_id' => '4', 'sub_category' => 'مازدا', 'category' => 'سيارات', "title" => "سيارات مازدا الرياضية", "description" => "تضم هذه الفئة أحدث سيارات مازدا الرياضية، والتي تجمع بين الأداء العالي والتصميم الجذاب والراحة الفائقة."],
            ['sub_categories_id' => '92', 'categories_id' => '4', 'sub_category' => 'مرسيدس', 'category' => 'سيارات', "title" => "سيارات مرسيدس الفاخرة", "description" => "تشمل هذه الفئة أحدث سيارات مرسيدس الفاخرة، التي تجمع بين الأداء العالي والتصميم الراقي والتكنولوجيا المتطورة."],
            ['sub_categories_id' => '94', 'categories_id' => '4', 'sub_category' => 'ميتسوبيشي', 'category' => 'سيارات', "title" => "سيارات ميتسوبيشي الرياضية", "description" => "تتضمن هذه الفئة أحدث سيارات ميتسوبيشي الرياضية، والتي تتميز بالأداء العالي والتصميم الجذاب والتقنيات المتطورة."],
            ['sub_categories_id' => '97', 'categories_id' => '4', 'sub_category' => 'نيسان', 'category' => 'سيارات', "title" => "أحدث سيارات نيسان", "description" => "استكشف أحدث موديلات نيسان وابحث عن السيارة التي تناسب احتياجاتك من بين مجموعة متنوعة من السيارات الاقتصادية والرياضية والعائلية."],
            ['sub_categories_id' => '99', 'categories_id' => '4', 'sub_category' => 'هوندا', 'category' => 'سيارات', "title" => "أفضل سيارات هوندا", "description" => "تعرف على أفضل سيارات هوندا واستكشف الأداء الرائع والتصميم الفريد الذي تتميز به سيارات هوندا من خلال مجموعة متنوعة من السيارات الاقتصادية والرياضية والعائلية."],
            ['sub_categories_id' => '100', 'categories_id' => '4', 'sub_category' => 'هيونداي', 'category' => 'سيارات', "title" => "أحدث سيارات هيونداي", "description" => "ابحث عن أحدث موديلات سيارات هيونداي التي تتميز بالتصميم العصري والأداء الممتاز. تصفح مجموعة متنوعة من السيارات الاقتصادية والرياضية والعائلية."],
            ['sub_categories_id' => '101', 'categories_id' => '4', 'sub_category' => 'متفرقات', 'category' => 'سيارات', "title" => "مجموعة متنوعة من السيارات", "description" => "تصفح مجموعة متنوعة من السيارات المختلفة التي تناسب جميع الأذواق والميزانيات. من السيارات الاقتصادية إلى الرياضية والعائلية وغيرها الكثير، ستجد السيارة التي تبحث عنها هنا."],
            ['sub_categories_id' => '140', 'categories_id' => '5', 'sub_category' => 'اتصالات', 'category' => 'خدمات', "title" => "خدمات اتصالات متميزة", "description" => "توفر خدمات اتصالات عالية الجودة والأداء المميز لعملائها في فلسطين."],
            ['sub_categories_id' => '141', 'categories_id' => '5', 'sub_category' => 'ارقام مميزة', 'category' => 'خدمات', "title" => "ارقام مميزة للبيع في فلسطين", "description" => "تقدم العديد من الأرقام المميزة للبيع في فلسطين بأسعار مناسبة للعملاء."],
            ['sub_categories_id' => '142', 'categories_id' => '5', 'sub_category' => 'اعمال واستثمار', 'category' => 'خدمات', "title" => "خدمات الاستثمار والأعمال في فلسطين", "description" => "توفر خدمات استثمارية وأعمال متنوعة في فلسطين للمهتمين بتأسيس وإدارة الأعمال."],
            ['sub_categories_id' => '143', 'categories_id' => '5', 'sub_category' => 'اكسسورات', 'category' => 'خدمات', "title" => "اكسسورات متنوعة في فلسطين", "description" => "تقدم خدمات البيع والشراء للعديد من الاكسسورات المتنوعة في فلسطين بجودة عالية وأسعار مناسبة."],
            ['sub_categories_id' => '144', 'categories_id' => '5', 'sub_category' => 'العاب', 'category' => 'خدمات', "title" => "العاب متنوعة في فلسطين", "description" => "توفر خدمات الشراء والبيع للعديد من الألعاب المتنوعة في فلسطين بجودة عالية وأسعار مناسبة."],
            ['sub_categories_id' => '145', 'categories_id' => '5', 'sub_category' => 'الكترونيات', 'category' => 'خدمات', "title" => "أجهزة الكترونية عالية الجودة في فلسطين", "description" => "توفر خدمات الشراء والبيع للعديد من الأجهزة الإلكترونية عالية الجودة في فلسطين بأسعار مناسبة."],
            ['sub_categories_id' => '146', 'categories_id' => '5', 'sub_category' => 'اليات ثقيلة', 'category' => 'خدمات', "title" => "خدمات اليات ثقيلة في فلسطين", "description" => "توفر هذه الخدمة جميع أنواع اليات البناء الثقيلة للإيجار بأسعار تنافسية في فلسطين. يتم توفير خدمات النقل والصيانة بالإضافة إلى التأجير."],
            ['sub_categories_id' => '148', 'categories_id' => '5', 'sub_category' => 'امن وحماية', 'category' => 'خدمات', "title" => "خدمات أنظمة الأمن والحماية في فلسطين", "description" => "تقدم هذه الخدمة تركيب وصيانة أنظمة الأمن والحماية للمنازل والشركات والمؤسسات في فلسطين. تشمل الخدمة أنظمة الإنذار والكاميرات والأقفال الإلكترونية وغيرها."],
            ['sub_categories_id' => '150', 'categories_id' => '5', 'sub_category' => 'تجهيز وتشطيب', 'category' => 'خدمات', "title" => "خدمات تجهيزات وتشطيبات في فلسطين", "description" => "توفر هذه الخدمة تصميم وتنفيذ أعمال الديكور والتشطيبات للمنازل والمحلات التجارية والمكاتب في فلسطين. تشمل الخدمة الدهانات والأرضيات والجدران الجبسية والأثاث والإضاءة."],
            ['sub_categories_id' => '151', 'categories_id' => '5', 'sub_category' => 'تحف ومقتنيات', 'category' => 'خدمات', "title" => "خدمات تحف ومقتنيات في فلسطين", "description" => "توفر هذه الخدمة بيع وشراء التحف والمقتنيات الفنية في فلسطين. يتم تقديم استشارات وتقييم للقطع الفنية والتحفية، بالإضافة إلى العمليات اللوجستية للشحن والتسليم."],
            ['sub_categories_id' => '154', 'categories_id' => '5', 'sub_category' => 'توصيل ونقل', 'category' => 'خدمات', "title" => "خدمات التوصيل والنقل", "description" => "تقديم خدمات التوصيل والنقل للمنتجات والبضائع والأفراد في فلسطين."],
            ['sub_categories_id' => '156', 'categories_id' => '5', 'sub_category' => 'حيوانات', 'category' => 'خدمات', "title" => "خدمات الحيوانات الأليفة", "description" => "توفير خدمات رعاية وصحة وتدريب وتسويق الحيوانات الأليفة في فلسطين."],
            ['sub_categories_id' => '157', 'categories_id' => '5', 'sub_category' => 'الصيانة', 'category' => 'خدمات', "title" => "خدمات الصيانة", "description" => "توفير خدمات الصيانة والإصلاح للأجهزة المنزلية والمكتبية والسيارات والآلات في فلسطين."],
            ['sub_categories_id' => '158', 'categories_id' => '5', 'sub_category' => 'زراعية', 'category' => 'خدمات', "title" => "خدمات زراعية", "description" => "توفير خدمات الزراعة والتربية والإنتاج الزراعي والحيواني في فلسطين."],
            ['sub_categories_id' => '159', 'categories_id' => '5', 'sub_category' => 'عقارية', 'category' => 'خدمات', "title" => "خدمات عقارية", "description" => "توفير خدمات العقارات والإسكان والتسويق العقاري والتقييم في فلسطين."],
            ['sub_categories_id' => '160', 'categories_id' => '5', 'sub_category' => 'دراجات نارية', 'category' => 'خدمات', "title" => "خدمات الدراجات النارية", "description" => "تقديم خدمات الصيانة والإصلاح والبيع والشراء للدراجات النارية في فلسطين."],
            ['sub_categories_id' => '161', 'categories_id' => '5', 'sub_category' => 'ساعات', 'category' => 'خدمات', "title" => "إصلاح الساعات", "description" => "خدمة إصلاح الساعات المتنوعة بأسعار معقولة وجودة عالية في فلسطين."],
            ['sub_categories_id' => '164', 'categories_id' => '5', 'sub_category' => 'طبخ منزلي', 'category' => 'خدمات', "title" => "خدمة طبخ منزلي", "description" => "تقدم خدمة الطبخ المنزلي وجبات صحية ولذيذة وفقًا للنظام الغذائي الذي يتناسب مع احتياجات الزبائن في فلسطين."],
            ['sub_categories_id' => '165', 'categories_id' => '5', 'sub_category' => 'عروض بالجملة', 'category' => 'خدمات', "title" => "عروض بالجملة", "description" => "تقدم خدمة عروض بالجملة للمنتجات المتنوعة بأسعار تنافسية وجودة عالية في فلسطين."],
            ['sub_categories_id' => '166', 'categories_id' => '5', 'sub_category' => 'عطورات', 'category' => 'خدمات', "title" => "عطورات فاخرة", "description" => "تقدم خدمة بيع العطورات الفاخرة الأصلية بأسعار مناسبة وجودة عالية في فلسطين."],
            ['sub_categories_id' => '168', 'categories_id' => '5', 'sub_category' => 'مستحضرات تجميل', 'category' => 'خدمات', "title" => "مستحضرات تجميل فاخرة", "description" => "تقدم خدمة بيع مستحضرات التجميل الفاخرة والعناية بالبشرة بأسعار مناسبة وجودة عالية في فلسطين."],
            ['sub_categories_id' => '169', 'categories_id' => '5', 'sub_category' => 'معدات بحرية', 'category' => 'خدمات', "title" => "معدات بحرية", "description" => "توفر خدمة بيع وصيانة معدات الصيد والبحرية المتنوعة بأسعار معقولة وجودة عالية في فلسطين."],
            ['sub_categories_id' => '171', 'categories_id' => '5', 'sub_category' => 'مفروشات', 'category' => 'خدمات', "title" => "تجديد المفروشات", "description" => "نحن نقدم خدمات تجديد المفروشات القديمة وإعادتها للحياة مرة أخرى بأسعار معقولة وجودة عالية."],
            ['sub_categories_id' => '172', 'categories_id' => '5', 'sub_category' => 'مفقودات', 'category' => 'خدمات', "title" => "البحث عن المفقودات", "description" => "إذا فقدت شيئًا مهمًا أو قيمًا، فنحن نوفر خدمات البحث عن المفقودات بجهود مكثفة وعمل مستمر لتقديم أفضل النتائج للعملاء."],
            ['sub_categories_id' => '173', 'categories_id' => '5', 'sub_category' => 'ملابس', 'category' => 'خدمات', "title" => "تصميم الملابس", "description" => "نحن نقدم خدمات تصميم الملابس الفريدة والمخصصة للعملاء، باستخدام الخامات عالية الجودة وأحدث التقنيات."],
            ['sub_categories_id' => '174', 'categories_id' => '5', 'sub_category' => 'مواد بناء', 'category' => 'خدمات', "title" => "توريد مواد البناء", "description" => "نوفر مجموعة واسعة من مواد البناء ذات الجودة العالية والأسعار التنافسية، مع توصيل سريع وخدمة عملاء ممتازة."],
            ['sub_categories_id' => '175', 'categories_id' => '5', 'sub_category' => 'مواد غذائية', 'category' => 'خدمات', "title" => "توريد مواد غذائية", "description" => "نحن نوفر مجموعة واسعة من المواد الغذائية ذات الجودة العالية والأسعار المعقولة، مع توصيل سريع وخدمة عملاء ممتازة."],
            ['sub_categories_id' => '176', 'categories_id' => '5', 'sub_category' => 'مولدات كهرباء', 'category' => 'خدمات', "title" => "صيانة مولدات الكهرباء", "description" => "خدمة صيانة مولدات الكهرباء لضمان عملها بكفاءة عالية في جميع الأوقات، وتوفير حلول لأي مشاكل قد تحدث في التشغيل، من خلال فريق متخصص وخبرة عالية في هذا المجال."],
            ['sub_categories_id' => '177', 'categories_id' => '5', 'sub_category' => 'هواتف ذكية', 'category' => 'اجهزة', "title" => "أحدث هواتف ذكية", "description" => "تصفح مجموعتنا من أحدث هواتف ذكية من العلامات التجارية الرائدة، مع التقنيات الحديثة والتصاميم الأنيقة."],
            ['sub_categories_id' => '178', 'categories_id' => '5', 'sub_category' => 'كاميرات', 'category' => 'اجهزة', "title" => "أجهزة التصوير الفوتوغرافي", "description" => "تصفح مجموعتنا الواسعة من أجهزة التصوير الفوتوغرافي، بما في ذلك الكاميرات الاحترافية والهواة، والعدسات المتنوعة."],
            ['sub_categories_id' => '179', 'categories_id' => '2', 'sub_category' => 'تلفزيون', 'category' => 'اجهزة', "title" => "شاشات التلفزيون", "description" => "تسوق الآن من مجموعتنا الرائعة من شاشات التلفزيون، بأحجام وتقنيات متنوعة، مع جودة عالية وأسعار تنافسية."],
            ['sub_categories_id' => '180', 'categories_id' => '2', 'sub_category' => 'غسالة', 'category' => 'اجهزة', "title" => "غسالات عالية الجودة", "description" => "اختر من بين غسالات الأطباق الأوتوماتيكية والشبه أوتوماتيكية، والموديلات ذات الأحجام المتنوعة، مع تقنيات مبتكرة لتوفير الطاقة والماء."],
            ['sub_categories_id' => '181', 'categories_id' => '2', 'sub_category' => 'ثلاجة', 'category' => 'اجهزة', "title" => "ثلاجات عالية الأداء", "description" => "اختر من بين مجموعتنا الواسعة من ثلاجات عالية الأداء، مع التقنيات الحديثة والأنماط المتنوعة، مع أسعار مميزة وجودة عالية."],
            ['sub_categories_id' => '182', 'categories_id' => '2', 'sub_category' => 'عجانة', 'category' => 'اجهزة', "title" => "عجانة للخبز والعجائن", "description" => "آلة عجن لعمل الخبز والمعجنات بكفاءة وسهولة في المنزل."],
            ['sub_categories_id' => '183', 'categories_id' => '2', 'sub_category' => 'فرن الغاز', 'category' => 'اجهزة', "title" => "فرن غاز للمنزل", "description" => "فرن غاز للاستخدام المنزلي، يساعد على طهي الطعام بكفاءة وسهولة."],
            ['sub_categories_id' => '184', 'categories_id' => '2', 'sub_category' => 'ميكرويف', 'category' => 'اجهزة', "title" => "ميكرويف للمطبخ", "description" => "جهاز يستخدم لتسخين وطهي الطعام بسرعة وفعالية في المطبخ."],
            ['sub_categories_id' => '185', 'categories_id' => '2', 'sub_category' => 'مكواه', 'category' => 'اجهزة', "title" => "مكواة كهربائية", "description" => "جهاز يستخدم لكي الملابس وإزالة التجاعيد ويعد من الأجهزة الأساسية في كل منزل."],
            ['sub_categories_id' => '186', 'categories_id' => '2', 'sub_category' => 'مروحة', 'category' => 'اجهزة', "title" => "مروحة كهربائية", "description" => "جهاز يستخدم لتدوير الهواء وتبريد الأجواء في الصيف، يمكن استخدامه في المنزل أو العمل."],
            ['sub_categories_id' => '187', 'categories_id' => '2', 'sub_category' => 'المكيفات', 'category' => 'اجهزة', "title" => "مكيفات هواء", "description" => "جهاز يستخدم لتبريد الهواء في الأجواء الحارة، يتوفر بمختلف الأحجام والقدرات لتلبية احتياجات المستخدمين."],
            ['sub_categories_id' => '188', 'categories_id' => '2', 'sub_category' => 'الخلاط', 'category' => 'اجهزة', "title" => "الخلاط الكهربائي", "description" => "يستخدم لخلط المكونات المختلفة لإعداد وصفات متنوعة من العصائر والكوكتيلات والشوربات وغيرها."],
            ['sub_categories_id' => '189', 'categories_id' => '2', 'sub_category' => 'مكنسة كهربائية', 'category' => 'اجهزة', "title" => "مكنسة كهربائية", "description" => "تستخدم لتنظيف الأرضيات والسجاد والأرائك والمفروشات وجميع أنواع الأتربة والأوساخ."],
            ['sub_categories_id' => '190', 'categories_id' => '2', 'sub_category' => 'الطابعات', 'category' => 'اجهزة', "title" => "الطابعة", "description" => "جهاز يستخدم لطباعة الوثائق والصور بشكل دقيق وعالي الجودة، وهي متوفرة بعدة أنواع وأحجام وموديلات."],
            ['sub_categories_id' => '191', 'categories_id' => '2', 'sub_category' => 'السماعات', 'category' => 'اجهزة', "title" => "السماعات", "description" => "تستخدم للاستماع إلى الموسيقى والأغاني والبرامج التلفزيونية والأفلام والألعاب الإلكترونية وتعتبر من الأجهزة الضرورية لكثير من الأشخاص."],
            ['sub_categories_id' => '192', 'categories_id' => '2', 'sub_category' => 'طبية', 'category' => 'اجهزة', "title" => "أجهزة طبية", "description" => "تشمل هذه الأجهزة كل ما يتعلق بالعلاج والوقاية والتشخيص الطبي، مثل جهاز ضغط الدم والجهاز الطبي للتنفس وجهاز الأشعة والعديد من الأجهزة الأخرى."],
            ['sub_categories_id' => '193', 'categories_id' => '2', 'sub_category' => 'منزلية', 'category' => 'اجهزة', "title" => "تجهيزات منزلية متكاملة", "description" => "احصل على جميع متطلبات منزلك في مكان واحد. نوفر لك أحدث التجهيزات المنزلية المتكاملة بأفضل الأسعار."],
            ['sub_categories_id' => '194', 'categories_id' => '2', 'sub_category' => 'اخرى', 'category' => 'اجهزة', "title" => "أجهزة حديثة ومبتكرة", "description" => "تصفح مجموعة واسعة من الأجهزة الحديثة والمبتكرة التي تلبي جميع احتياجاتك. توفر لك الراحة والتقنية في مكان واحد."],
            ['sub_categories_id' => '196', 'categories_id' => '7', 'sub_category' => 'عاجل', 'category' => 'اخبار', "title" => "تطورات حالية", "description" => "آخر التطورات والأحداث الحالية في فلسطين."],
            ['sub_categories_id' => '197', 'categories_id' => '7', 'sub_category' => 'غزة', 'category' => 'اخبار', "title" => "أخبار غزة", "description" => "أحداث وتقارير محلية ودولية عن قطاع غزة."],
            ['sub_categories_id' => '198', 'categories_id' => '7', 'sub_category' => 'الضفة', 'category' => 'اخبار', "title" => "تحديثات الضفة الغربية", "description" => "أخبار وأحداث الضفة الغربية والتطورات السياسية والاقتصادية والاجتماعية."],
            ['sub_categories_id' => '199', 'categories_id' => '7', 'sub_category' => 'القدس', 'category' => 'اخبار', "title" => "أخبار القدس", "description" => "أحداث ومستجدات القدس والتطورات القانونية والثقافية والتاريخية."],
            ['sub_categories_id' => '200', 'categories_id' => '7', 'sub_category' => 'اراضي ال 48', 'category' => 'اخبار', "title" => "أخبار الأراضي الداخلية", "description" => "أحداث وتقارير عن الأراضي الداخلية الفلسطينية المحتلة من عام 1948."],
            ['sub_categories_id' => '201', 'categories_id' => '7', 'sub_category' => 'في الخارج', 'category' => 'اخبار', "title" => "أخبار فلسطين في الخارج", "description" => "أخبار الجاليات الفلسطينية في مختلف أنحاء العالم ودورها في قضية فلسطين."],
            ['sub_categories_id' => '202', 'categories_id' => '7', 'sub_category' => 'سياسة', 'category' => 'اخبار', "title" => "أخبار سياسية", "description" => "آخر المستجدات السياسية في فلسطين والتطورات الدولية ذات الصلة."],
            ['sub_categories_id' => '203', 'categories_id' => '7', 'sub_category' => 'اقتصاد', 'category' => 'اخبار', "title" => "تطورات الاقتصاد الفلسطيني", "description" => "أخبار الاقتصاد الوطني والمحلي في فلسطين والتحديات والفرص الاقتصادية."],
            ['sub_categories_id' => '204', 'categories_id' => '7', 'sub_category' => 'اسرائيليات', 'category' => 'اخبار', "title" => "مستجدات اسرائيلية", "description" => "أخبار وتقارير عن السياسة والثقافة والمجتمع في إسرائيل وتأثيرها على القضية الفلسطينية."],
            ['sub_categories_id' => '205', 'categories_id' => '7', 'sub_category' => 'الصحة', 'category' => 'اخبار', "title" => "أخبار الصحة", "description" => "أحدث المستجدات والتطورات في مجال الصحة في فلسطين ومبادرات الرعاية الصحية."],
            ['sub_categories_id' => '206', 'categories_id' => '7', 'sub_category' => 'التعليم', 'category' => 'اخبار', "title" => "تحديثات التعليم", "description" => "أخبار وتطورات النظام التعليمي في فلسطين والإصلاحات والمبادرات التعليمية."],
            ['sub_categories_id' => '207', 'categories_id' => '7', 'sub_category' => 'التكنولوجيا', 'category' => 'اخبار', "title" => "أخبار التكنولوجيا", "description" => "آخر المستجدات والابتكارات التكنولوجية في فلسطين ودورها في التنمية والتقدم."],
            ['sub_categories_id' => '208', 'categories_id' => '7', 'sub_category' => 'محلي', 'category' => 'اخبار', "title" => "أخبار محلية", "description" => "أحداث ومستجدات على المستوى المحلي في مختلف المدن والبلدات الفلسطينية."],
            ['sub_categories_id' => '209', 'categories_id' => '7', 'sub_category' => 'عربي', 'category' => 'اخبار', "title" => "أخبار عربية", "description" => "آخر المستجدات والأحداث في العالم العربي وتأثيرها على الشأن الفلسطيني."],
            ['sub_categories_id' => '210', 'categories_id' => '7', 'sub_category' => 'دولي', 'category' => 'اخبار', "title" => "أخبار دولية", "description" => "أحداث وتطورات دولية ذات صلة بالقضية الفلسطينية والتأثير على الشأن الإقليمي والدولي."],
            ['sub_categories_id' => '211', 'categories_id' => '7', 'sub_category' => 'المجتمع', 'category' => 'اخبار', "title" => "أخبار المجتمع", "description" => "أخبار ومستجدات المجتمع الفلسطيني والقضايا الاجتماعية والثقافية والحقوقية."],
            ['sub_categories_id' => '212', 'categories_id' => '7', 'sub_category' => 'اعمال وشركات', 'category' => 'اخبار', "title" => "أخبار الأعمال والشركات", "description" => "أحدث التطورات في قطاع الأعمال والشركات في فلسطين والفرص الاستثمارية."],
            ['sub_categories_id' => '213', 'categories_id' => '7', 'sub_category' => 'سفر وسياحة', 'category' => 'اخبار', "title" => "أخبار السفر والسياحة", "description" => "أخبار ومعلومات عن السفر والسياحة في فلسطين والوجهات السياحية والفعاليات السياحية."],
            ['sub_categories_id' => '214', 'categories_id' => '7', 'sub_category' => 'ثقافة وفنون', 'category' => 'اخبار', "title" => "أخبار الثقافة والفنون", "description" => "أخبار وفعاليات الثقافة والفنون في فلسطين والمبادرات الثقافية والمعارض الفنية."],
            ['sub_categories_id' => '215', 'categories_id' => '7', 'sub_category' => 'ترفيه', 'category' => 'اخبار', "title" => "أخبار الترفيه", "description" => "أحدث الفعاليات الترفيهية والمناسبات الثقافية والترفيهية في فلسطين."],
            ['sub_categories_id' => '216', 'categories_id' => '7', 'sub_category' => 'منوعات', 'category' => 'اخبار', "title" => "أخبار منوعة", "description" => "أخبار ومواضيع منوعة تشمل مجموعة متنوعة من القضايا والمواضيع في فلسطين."],


        );
        $user = User::inRandomOrder()->first();
        // Get a random category
        $jobPost = $Posts[$PostIndex++ % count($Posts)];
        return [
            'user_id' => $user->id,
            'title' =>  $jobPost['title'],
            'description' =>  $jobPost['description'],
            'category' =>  $jobPost['category'],
            'sub_category' =>  $jobPost['sub_category'],
            'country_id' => $user->country,
            'city_id' => $user->city,
            'price' => $this->faker->numberBetween(1, 5000),
            'price_currency' => $this->faker->randomElement(['شيكل', 'دولار امريكي', 'دينار اردني']),
            'location_latitudes' => fake()->latitude(31.2, 32.5),
            'location_longitudes' => fake()->longitude(34.2, 35.5),
            'type' => $this->faker->randomElement(['عرض', 'طلب']),
            'categories_id' => $jobPost['categories_id'],
            'sub_categories_id' => $jobPost['sub_categories_id'],
        ];
    }

    public function configure(): ServicePostFactory
    {
        return $this->afterCreating(function (ServicePost $servicePost) {
            $usersFav = User::all()->random(10);
            foreach ($usersFav as $user) {
                $favorite = new Favorite();
                $favorite->user_id = $user->id;
                $servicePost->favorites()->save($favorite);
            }
            $servicePost->favorites_count = $servicePost->favorites()->count();
            $servicePost->save();
            $usersReport = User::all()->random(3);
            foreach ($usersReport as $user) {
                $reports = new Report();
                $reports->user_id = $user->id;
                $reports->reason = $this->faker->randomElement(['Spam', 'inappropriate content', 'Harassment', 'false information']);
                $servicePost->reports()->save($reports);
            }
            $servicePost->report_count = $servicePost->reports()->count();
            $servicePostPhotosSrc = [
                'photos/servicepost1.jpg',
                'photos/servicepost2.jpg',
                'photos/servicepost3.jpg',
                'photos/servicepost4.jpg',
                'photos/servicepost5.jpg',
            ];
            $randomNumber = rand(2, 4); // Generate a random number between 3 and 5 (inclusive)
            $randomKeys = array_rand($servicePostPhotosSrc, $randomNumber);
            foreach ($randomKeys as $key) {
                $photo = new Photos([
                    'src' => $servicePostPhotosSrc[$key],
                ]);
                $servicePost->photos()->save($photo);
            }
            $servicePost->save();
        });
    }
}
